1s/ERP/Conf/InformationRegisters/Лико_ЗаписьОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЗаписьОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Потоки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УидФЗ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектыДляЗаписи</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЗаписьОбъектов/Ext/ManagerModule.bsl
Функция ПараметрПроведение() Экспорт  //+Лико m.shenderov 11.02.2022
	Возврат "Проведение";	
КонецФункции //-Лико m.shenderov 11.02.2022 

Функция ПараметрЗагрузка() Экспорт  //+Лико m.shenderov 11.02.2022
	Возврат "Загрузка";	
КонецФункции //-Лико m.shenderov 11.02.2022 


Функция ПараметрДляПересчета() Экспорт  //+Лико m.shenderov 11.02.2022
	Возврат "ДляПересчета";	
КонецФункции //-Лико m.shenderov 11.02.2022 


Функция ПараметрЗапись() Экспорт  //+Лико m.shenderov 11.02.2022
	Возврат "Запись";	
КонецФункции //-Лико m.shenderov 11.02.2022 



Процедура ДобавитьВОчередь(МассивСсылок,ИмяОперации="",Параметр="",Потоки=1)Экспорт //+Лико m.shenderov 11.02.2022
	
	Потоки=?(Потоки=0,1,Потоки);
	
	НачатьТранзакцию();
	Для каждого Ссылка Из МассивСсылок Цикл 
		
		НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
		НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
		НаборЗаписей.Отбор.Параметр.Установить(Параметр);
		
		Запись              = НаборЗаписей.Добавить();
		
		Запись.Ссылка		= Ссылка;   
		Запись.ИмяОперации	= ИмяОперации;
		Запись.Параметр		= Параметр;
		Запись.Потоки		= Потоки;
		
		НаборЗаписей.Записать(Истина);
		
		
		
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	
	
КонецПроцедуры //-Лико m.shenderov 11.02.2022

Процедура ВыполнитьОперацииИзОчереди() Экспорт  //+Лико m.shenderov 11.02.2022
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаписьОбъектов.Ссылка КАК Ссылка,
	|	Лико_ЗаписьОбъектов.ИмяОперации КАК ИмяОперации,
	|	Лико_ЗаписьОбъектов.Параметр КАК Параметр,
	|	Лико_ЗаписьОбъектов.Потоки КАК Потоки,
	|	Лико_ЗаписьОбъектов.Порядок КАК Порядок,
	|	1 КАК Количество
	|ИЗ
	|	РегистрСведений.Лико_ЗаписьОбъектов КАК Лико_ЗаписьОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ
	|	МАКСИМУМ(Параметр),
	|	МАКСИМУМ(Потоки),
	|	СУММА(Количество)
	|ПО
	|	ИмяОперации";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИмяОперации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИмяОперации.Следующий() Цикл
		Потоки=ВыборкаИмяОперации.Потоки;
		Количество=ВыборкаИмяОперации.Количество;
		Партия=Цел(Количество/Потоки);
		ТекущаяПартия=Партия;
		Выборка = ВыборкаИмяОперации.Выбрать();
		Сч=Выборка.Количество();
		МассивПараметров = Новый Массив();
		МассивСсылок = Новый Массив();
		Пока Выборка.Следующий() Цикл 
			ТекущаяПартия = ТекущаяПартия-1;
			Сч            = Сч-1;
			МассивСсылок.Добавить(Выборка.Ссылка);
			
			Если ТекущаяПартия=0 Или Сч=0 Тогда
				МассивПараметров.Добавить(МассивСсылок);
				МассивПараметров.Добавить(ВыборкаИмяОперации.ИмяОперации);
				МассивПараметров.Добавить(ВыборкаИмяОперации.Параметр);
				
				ИмяМетода = ПолучитьИмяМетода(ВыборкаИмяОперации.Параметр);
				ФЗ        = ФоновыеЗадания.Выполнить(ИмяМетода,МассивПараметров,,ВыборкаИмяОперации.ИмяОперации);
				
							
				Для каждого Ссылка Из МассивСсылок Цикл
					
					НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
					
					НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
					НаборЗаписей.Отбор.ИмяОперации.Установить(ВыборкаИмяОперации.ИмяОперации);
					НаборЗаписей.Отбор.Параметр.Установить(ВыборкаИмяОперации.Параметр);
					НаборЗаписей.Прочитать();
					
					Для каждого Запись Из НаборЗаписей Цикл
						Запись.УидФЗ= ФЗ.УникальныйИдентификатор;
					КонецЦикла;
					
					НаборЗаписей.Записать(Истина);
					
					
					
				КонецЦикла;
					МассивСсылок		=	Новый Массив;
					МассивПараметров	=	Новый Массив;
				
				
			КонецЕсли;
			
		КонецЦикла;	
	КонецЦикла; 
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 11.02.2022



Процедура ПроведениеВыполнить(МассивСсылок,ИмяОперации="",Параметр="")Экспорт  //+Лико m.shenderov 11.02.2022
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Попытка
			НачатьТранзакцию();
			
			Объект=Ссылка.ПолучитьОбъект();
			Объект.Записать(РежимЗаписиДокумента.Проведение); 
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
			
		Исключение  
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.Ошибка= ОписаниеОшибки()
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			
			//ОписаниеОшибки()
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 11.02.2022



Процедура ДляПересчетаВыполнить(МассивСсылок,ИмяОперации="",Параметр="") Экспорт  //+Лико m.shenderov 11.02.2022
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Попытка
			НачатьТранзакцию();
			
			#Если ВнешнееСоединение Тогда
				
			#Иначе
				Лико_Планирование.ЗаполнениеПараметровВыпуска(Ссылка, Ложь);
			#КонецЕсли	
			
			
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
			
		Исключение  
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.Ошибка= ОписаниеОшибки()
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			
			//ОписаниеОшибки()
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 11.02.2022



Функция ПолучитьИмяМетода(Параметр) //+Лико m.shenderov 11.02.2022
	Возврат СтрШаблон("Лико_АсинхронныеПроцедуры.%1Выполнить",Параметр);
	
КонецФункции //-Лико m.shenderov 11.02.2022
